{"modelTopology": {"training_config": {"metrics": ["accuracy"], "sample_weight_mode": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"decay": 0.0010000000474974513, "epsilon": 1e-08, "beta_2": 0.9990000128746033, "amsgrad": false, "beta_1": 0.8999999761581421, "lr": 0.009999999776482582}}, "loss": "categorical_crossentropy"}, "model_config": {"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Dense", "config": {"bias_constraint": null, "batch_input_shape": [null, 60], "bias_regularizer": null, "trainable": true, "activation": "relu", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": true, "kernel_constraint": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 35, "dtype": "float32", "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "noise_shape": null, "seed": null, "trainable": true, "rate": 0.1}}, {"class_name": "Dense", "config": {"bias_constraint": null, "batch_input_shape": [null, 60], "bias_regularizer": null, "trainable": true, "activation": "relu", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": true, "kernel_constraint": null, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 30, "dtype": "float32", "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "noise_shape": null, "seed": null, "trainable": true, "rate": 0.1}}, {"class_name": "Dense", "config": {"bias_constraint": null, "batch_input_shape": [null, 60], "bias_regularizer": null, "trainable": true, "activation": "relu", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": true, "kernel_constraint": null, "name": "dense_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 25, "dtype": "float32", "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "noise_shape": null, "seed": null, "trainable": true, "rate": 0.1}}, {"class_name": "Dense", "config": {"bias_constraint": null, "batch_input_shape": [null, 60], "bias_regularizer": null, "trainable": true, "activation": "relu", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": true, "kernel_constraint": null, "name": "dense_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 20, "dtype": "float32", "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "noise_shape": null, "seed": null, "trainable": true, "rate": 0.1}}, {"class_name": "Dense", "config": {"bias_constraint": null, "batch_input_shape": [null, 60], "bias_regularizer": null, "trainable": true, "activation": "relu", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": true, "kernel_constraint": null, "name": "dense_5", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 15, "dtype": "float32", "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "noise_shape": null, "seed": null, "trainable": true, "rate": 0.1}}, {"class_name": "Dense", "config": {"bias_constraint": null, "bias_regularizer": null, "trainable": true, "activation": "softmax", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": true, "kernel_constraint": null, "name": "dense_6", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 10, "activity_regularizer": null}}]}}, "keras_version": "2.2.4", "backend": "tensorflow"}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"dtype": "float32", "name": "dense_1/kernel", "shape": [60, 35]}, {"dtype": "float32", "name": "dense_1/bias", "shape": [35]}, {"dtype": "float32", "name": "dense_2/kernel", "shape": [35, 30]}, {"dtype": "float32", "name": "dense_2/bias", "shape": [30]}, {"dtype": "float32", "name": "dense_3/kernel", "shape": [30, 25]}, {"dtype": "float32", "name": "dense_3/bias", "shape": [25]}, {"dtype": "float32", "name": "dense_4/kernel", "shape": [25, 20]}, {"dtype": "float32", "name": "dense_4/bias", "shape": [20]}, {"dtype": "float32", "name": "dense_5/kernel", "shape": [20, 15]}, {"dtype": "float32", "name": "dense_5/bias", "shape": [15]}, {"dtype": "float32", "name": "dense_6/kernel", "shape": [15, 10]}, {"dtype": "float32", "name": "dense_6/bias", "shape": [10]}]}]}